Саракташ2/src/Catalogs/Мастерицы/Мастерицы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мастерицы</name>
  <attributes>
    <name>НаСайте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляПроизводства</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Артикулы</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Саракташ2/src/Catalogs/Мастерицы/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отбор = Неопределено;
	Если Параметры.Свойство("Отбор", Отбор) Тогда
		Если Отбор.Свойство("НаСайте") И Отбор.НаСайте = Истина Тогда
			Заголовок = "Мастерицы для проверки";
			Элементы.Список.ТолькоПросмотр = Истина;
		КонецЕсли;
		Если Отбор.Свойство("ДляПроизводства") И Отбор.ДляПроизводства = Истина Тогда
			Заголовок = "Вязальщицы в Саракташе"; 			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
